## -----------------------------------------------------------------------------
## 내장 모듈 random 활용
## - random -> 
## -----------------------------------------------------------------------------
import random

## => 0~1 사이의 실수 난수 반환
print(random.random())

## => n이상 m이하의 정수 난수 반환
print(random.randint(1,10))

## => n이상 m미만의 실수 난수 반환
print(random.uniform(0,100))


## -----------------------------------------------------------------------------
## 복원 & 비복원 난수 추출 및 무작위 섞기
## -----------------------------------------------------------------------------
fruits = ['apple', 'banana', 'cherry', 'mango']

##=> 무작위로 하나 선택
print(random.choice(fruits))

## => 무작위로 2개 선택(중복 가능) : 복원
print(random.choices(fruits, k=2))

## => 무작위로 2개 선택(중복 없음) : 비복원
print(random.sample(fruits,2))

## => 리스트 무작위 섞기
random.shuffle(fruits)
print(fruits)




## -------------------------------------------------------------------------------
## 재현성 유지 설정 및 난수 추출
## -------------------------------------------------------------------------------
## => 매번 다른 난수 추출
for _ in range(5):
    print(random.randint(1,100), end=" " )

## 재현성 유지 설정
random.seed(42)
print("\n난수 추출 고정+++++++++++")

## => 매번 동일한 난수 추출
for _ in range(5) :
    print(random.randint(1,100), end=" ")