## -------------------------------------------------------------------
## 4칙연산 계산기
## -------------------------------------------------------------------
## 클래스 기능 : 4칙연산 수행 관련 클래스
## 클래스 이름 : Calc4
## 부모 클래스 : 없음
## 속      성 : 없음
## 메  서  드 : plus, mius, mult, div
## -------------------------------------------------------------------

class Calc4:
    ## 인스턴스 초기화 메서드 필요 없음

    ## --------------------------------------------
    ## 인스턴스 메서드
    ## --------------------------------------------
    def plus(self,a,b) : return a + b
    def mius(self,a,b) : return a - b
    def mult(self,a,b) : return a * b
    def div(self,a,b)  : return a / b if b else '0으로 나눌 수 없음'

class sCalc4:
    ## 인스턴스 초기화 메서드 필요 없음

    ## --------------------------------------------
    ## 정적 메서드 : 인스턴스, 클래스 모두 사용하지 않음
    ## --------------------------------------------
    @staticmethod
    def plus(a,b) : return a + b
    @staticmethod
    def mius(a,b) : return a - b
    @staticmethod  
    def mult(a,b) : return a * b
    @staticmethod  
    def div(a,b)  : return a / b if b else '0으로 나눌 수 없음'

## -------------------------------------------------------------------
## 계산 진행
## -------------------------------------------------------------------
## => 인스턴스/객체 생성
myCalc = Calc4()
print(myCalc.plus(1,2), myCalc.mius(5,2))

## => 정적 메서드는 객체 생성 필요 없음!
# ★★ 걍 함수인데 기능끼리 묶을라고 클래스에 넣은 거임 ★★
print(sCalc4.plus(1,2), sCalc4.div(5,0))