## ------------------------------------------------------
## 인스턴스/객체 생성 및 활용
## ------------------------------------------------------

## 모듈 로딩
import ex_test as t

## ------------------------------------------------------
## 인스턴스/객체 생성 => 변수명 = 클래스명()
## ------------------------------------------------------
## 학생 인스턴스/객체 생성
d1 = t.Doctor('대구한방병원','홍길동', 3, 'ko-doc-001')
d2 = t.Doctor('경북종합병원','김닥터', 10, 'ko-doc-011')

## ------------------------------------------------------
## 인스턴스/객체 활용 => 변수명.속성명 / 변수명.메서드명()
## ------------------------------------------------------
d1.printDoctor()
print('공개   속성 :',d1.KIND, d1.hname)
# print('비공개 속성 :',d1.__id) #ERROR, 없는 값이라고 뜲
print('비공개 속성 :', d1.get_id())

## ------------------------------------------------------
## 인스턴스/객체 활용 => 변수명.속성명 = 새로운 값
##                  ** 비공개 값은 변경이 아닌 새로운 속성이 추가됨 **
##                  ** 단, 해당 인스턴스에만 추가됨 **
## ------------------------------------------------------
d1.year = 5
d1.printDoctor()