## --------------------------------------------------------------------------
## 예외처리(Exception Handling)
## - 계발자가 처리 가능한 오류 처리
## - 발생한 오류에 대한 적절한 대응 및 무시
## --------------------------------------------------------------------------
## 나눗셈에서 발생하는 오류 : 0으로 나눔
## - 데이터 : 리스트 [10, 20, 30]
## - 나눌값 : 입력 받기
## --------------------------------------------------------------------------

## --------------------------------------------------------------------------
## 1. 모든 예외/에러 다 처리 해주는 예외처리
## --------------------------------------------------------------------------
try :
    data = [10, 20, 30]
    idx, x = list(map(int, input("인덱스와 나눌 수 입력(예: 0 3) : ").split()))

    result = data[idx] / x
    print(result)
except :
    print("EROOR 발생")

else :
    print(f'{idx}번 요소를 {x}로 나눈 결과 : {result}')



## --------------------------------------------------------------------------
## 2. 특정 에러 처리
## --------------------------------------------------------------------------
try :
    data = [10, 20, 30]
    idx, x = list(map(int, input("인덱스와 나눌 수 입력(예: 0 3) : ").split()))

    result = data[idx] / x
    print(result)
except ZeroDivisionError:
    print("EROOR 발생")
except Exception as e :
    print(e, "발생했습니다.")

else :
    print(f'{idx}번 요소를 {x}로 나눈 결과 : {result}')