## --------------------------------------------------------------------------
## 예외처리(Exception Handling)
## - 계발자가 처리 가능한 오류 처리
## - 발생한 오류에 대한 적절한 대응 및 무시
## --------------------------------------------------------------------------
## 나눗셈에서 발생하는 오류 : 0으로 나눔
## --------------------------------------------------------------------------

## --------------------------------------------------------------------------
## 1. try ~ except
## --------------------------------------------------------------------------
num1, num2 = 21 ,0
try : 
    print(f'{num1} / {num2} = {num1/num2}')
except ZeroDivisionError :
    print("catch ERROR")

## --------------------------------------------------------------------------
## 2. try ~ except ~ else
## --------------------------------------------------------------------------

try : # 오류가 발생할만한 코드들
    num1, num2 = 21 ,1
    result = num1/num2 
    
except ZeroDivisionError : # 오류 발생 시 처리 코드
    print("catch ERROR")
else: # 오류가 발생하지 않은 경우 처리 코드
    print(f'{num1}/{num2} = {result}')


## --------------------------------------------------------------------------
## 3. try ~ except ~ else ~ finally
## --------------------------------------------------------------------------

try : # 오류가 발생할만한 코드들
    num1, num2 = 21 ,1
    result = num1/num2 
    
except ZeroDivisionError : # 오류 발생 시 처리 코드
    print("catch ERROR")
else: # 오류가 발생하지 않은 경우 처리 코드
    print(f'{num1}/{num2} = {result}')
finally: # 마지막에 무조건 시행
    print("끝")