## -----------------------------------------------------------------------
## 계산기 프로그램
## - 4칙 연산
## - 연산 결과/이력 저장
## - 터미널을 통한 메뉴 출력 & 사용자의 선택으로 진행
## - 사용자의 종료 입력 전까지 반복
## -----------------------------------------------------------------------
## 사용자 정의 함수들
## -----------------------------------------------------------------------
## 함수기능 : 메인메뉴 출력 기능
## 함수이름 : printMenu
## 매개변수 : 없음
## 결과반환 : 없음
## -----------------------------------------------------------------------
def printMenu():
    print(f'{"선택":-^20}')
    print(f'{"1. 입 력":^20}')
    print(f'{"2. 덧 셈":^20}')
    print(f'{"3. 뺄 셈":^20}')
    print(f'{"4. 곱 셈":^20}')
    print(f'{"5. 나눗셈":^20}')
    print(f'{"6. 기 록":^20}')
    print(f'{"7. 종 료":^20}')
    print(f'{"":-^22}')

## -----------------------------------------------------------------------
## 함수기능 : 연산에 사용될 데이터 입력 받기 기능
## 함수이름 : inputData
## 매개변수 : 없음
## 결과반환 : 입력 받은 데이터
## -----------------------------------------------------------------------
def inputData() :
    return input("2개 정수 입력(예시: 30 2) : ").split()

## -----------------------------------------------------------------------
## 함수기능 : 덧셈결과 출력
## 함수이름 : plus
## 매개변수 : 없음
## 결과반환 : 없음
## -----------------------------------------------------------------------
def plus() :
    global n1, n2
    print(f'{n1} + {n2} = {n1+n2}')
    saveHistroy(F_NAME,f'{n1} + {n2} = {n1+n2}')
    n1, n2 = None, None

## -----------------------------------------------------------------------
## 함수기능 : 연산 결과 저장 함수
## 함수이름 : saveHistroy
## 매개변수 : filename - 경로포함한 파일명
##           data    - 파일에 저장할 데이터
## 결과반환 : 파일에 쓴 문자 개수 반환
## -----------------------------------------------------------------------
def saveHistroy(filename,data):
    with open(filename, mode='a', encoding='utf-8') as F:
        F.write(data+'\n')


## -----------------------------------------------------------------------
## 함수기능 : 연산 결과 출력
## 함수이름 : printHistroy
## 매개변수 : filename - 경로포함한 파일명
## 결과반환 : 파일에 쓴 문자 개수 반환
## -----------------------------------------------------------------------
def printHistroy(filename):
    with open(filename, mode='r', encoding='utf-8') as F:
        lines = F.readlines()
    lines.reverse()
    for line in lines :
        print(line.strip())

## -----------------------------------------------------------------------
## 프로그램 구동 부분
## -----------------------------------------------------------------------
print(f'{"계산기 프로그램 시작":^20}')
n1, n2 = None, None
F_NAME = './histroy.txt'
while 1 :
    #메뉴 출력
    printMenu()
    cmd = input("선택 :")

    ## 종료 체크 및 처리
    if cmd == "7" : break
    elif cmd == '1':
        n1, n2 = map(int,inputData())
        print(n1, n2)
    elif cmd == '2':
        if n1 != None and n2 != None : plus()
        else : print("n1, n2 값이 없습니다.")
    elif cmd == '3':
        pass
    elif cmd == '4':
        pass
    elif cmd == '5':
        pass
    elif cmd == '6':
        printHistroy(F_NAME)
    else : print("존재하지 않는 항목입니다.")
    
print("계산기 프로그램 종료")