## -------------------------------------------------------------
## 내장 패키지  datetime 활용
## - datetime   => 날짜와 시간 처리를 위해 자주 사용
##              => 날짜 생성, 현재시각, 포맷 변환, 날짜 차이 계산
## -------------------------------------------------------------
## 모듈 로딩
## -------------------------------------------------------------
from datetime import datetime   ## 날짜와 시간 관련 모듈
from datetime import timedelta  ## 시간계산 관련 모듈


## -------------------------------------------------------------
## 1. 모듈 기본 활용
## -------------------------------------------------------------
print('\n1. 날짜 시간 기본 -------------')
##=> 현재 날짜와 시간
now = datetime.now()
print(f'현재시각 : {now}')

##=> 오늘 날짜
today = datetime.today()
print(f'오늘 날짜 : {today.date()}')

## 특정 날짜/시간 생성 2025년 1월 1일 오전 9시 생성
dt = datetime(2025,1,1,19,0,0)
print(f'지정된 날짜 : {dt}')


## -------------------------------------------------------------
## 2. 날짜 -> 문자열 변환 (strftime(형식지정 문자열))
## -------------------------------------------------------------
print('\n2. 날짜 -> 문자열 변환 -------------------')
now = datetime.now()

## Y: 년도(4자리), m:월(2자리), d:일(2자리)
## H:시(24시간, 2자리), h:시(12시간, 2자리), M:분(2자리), S:초(2자리)
## A:요일(풀네임), a:요일(약어)
## B:월(풀네임), b:월(약어)
print(f"년-월-일 : {now.strftime('%Y-%m-%d')}")
print(f"년-월-일 : {now.strftime('%Y-%B-%d')}")
print(f"시:분:초 : {now.strftime('%H-%M-%S')}")
print(f'요    일 : {now.strftime("%A")}' )
print(f'짧은요일 : {now.strftime("%a")}' )

## -------------------------------------------------------------
## 3. 문자열 -> 날짜 변환(strptime(문자열 datetime, 문자열 형식 지정자))
## -------------------------------------------------------------
print('\n3. 문자열 -> 날짜 변환 ---------------------')
date_str = '2025-10-02 14:30:00'
dt       = datetime.strptime(date_str, "%Y-%m-%d %H:%M:%S")
print('변환된 datetime 객체 :', dt, dt.month)

## -------------------------------------------------------------
## 4. 날짜 시간 차이 계산 (timedalta)
## - timedalta : 날짜/시간 차이 계산
## -------------------------------------------------------------
print('\n4. 날짜 시간 차이 계산 -----------------')
## 현재 시간 날짜
today = datetime.today()

## => 7일뒤 
weak_later = today + timedelta(days=7)
print(f'일주일 뒤 : {weak_later}')

## => 30일 전
month_ago = today - timedelta(days=30)
print(f'30일 전 : {month_ago}')

## => 두 날짜 차이
d1 = datetime(2025,10,1)
d2 = datetime(2025,12,1)
diff = d2 - d1
print(f'두 날짜 차이(일) : {diff.days}')

## -------------------------------------------------------------
## 5. 날짜와 시간 분리
## -------------------------------------------------------------
print("\n5. 날짜와 시간 분리 ----------------")
## 현재 날짜 시간
now = datetime.now()

print(f'날짜 시간 : {now}')
print(f'날짜 부분 : {now.date()}')
print(f'시간 부분 : {now.time()}')
