## ====================================================================
##              Python GUI Programming - TKinter 
## ====================================================================
## 동일 간격 Grid 설정
## - 프레임/윈도우(그리드의 부모)에서 제공 메서드
##   * 행과 열 설정
##   * grid_rowconfigure() / grid_columnconfigure() 
##      -> 매개변수
##          weight	: 남는 세로/가로 공간 분배 비율	0(기본, 안 늘어남), 1, 2… (크면 더 많이 가져감)
##          minsize : 해당 행/열의 최소 높이(px)	픽셀값(예: 80)
##          uniform	: 같은 키를 가진 행들의 높이를 동일하게	문자열 키(예: "row")
##                    같은 키끼리 동일 높이로 강제
## ====================================================================

## --------------------------------------------------------------------
## 모듈 로딩 
## --------------------------------------------------------------------
import tkinter

## --------------------------------------------------------------------
##- 윈도우 관련 
## --------------------------------------------------------------------
##- 윈도우 창 인스턴스 생성 및 설정
window=tkinter.Tk()
window.title("** Equal Grid **")
window.geometry("900x400")

##- 전역 변수
ROWS    = 4
COLS    = 4
## 색상코드 #RRGGBB
COLORS  = ["#4A90E2","#50E3C2","#9013FE","#F5A623","#7B8D93"]

## ------------------------------------------------------
## 함수기능 : 모든 행/열을 동일 비율로 설정
## 함수이름 : make_equal_grid
## 매개변수 : parent
##           rows
##           cols
## 결과반환 : 없음
## ------------------------------------------------------
def make_equal_grid(parent, rows, cols):
    # 모든 행/열을 동일 비율로
    for r in range(rows):
        parent.grid_rowconfigure(r, weight=1, uniform="row")
    for c in range(cols):
        parent.grid_columnconfigure(c, weight=1, uniform="col")


## --------------------------------------------------------------------
##- 윈도우 화면 GRID 설정 
## --------------------------------------------------------------------
##- 행/열 동일 간격 설정 
make_equal_grid(window, ROWS, COLS)

##- 셀 확인용: 전 셀을 색 박스로 채움
for r in range(ROWS):
    for c in range(COLS):
        lb = tkinter.Label(window, 
                           bg=COLORS[(r*COLS+c) % len(COLORS)], 
                           bd=1, 
                           relief="solid", 
                           text=f"r{r} c{c}"
                           )
        lb.grid(row=r, column=c, sticky="nsew", padx=2, pady=2)   

## --------------------------------------------------------------------
##- 윈도우에서 발생하는 사용자 이벤트 수신
## --------------------------------------------------------------------
##- 종료 전까지 동작
window.mainloop()