## ====================================================================
##              Python GUI Programming - TKinter 
## ====================================================================
## Container Layout : Place
##   * Window/화면 상의 절대적 위치에 UI요소 배치
##   * 크기 조정 가능
##   * pack()과 같이 사용될 수 없음. grid()와는 같이 사용할 수 있음
##   * 사용법
##     위젯이름.place(매개변수1, 매개변수2, 매개변수3, ...)
##   * 주요 매개변수
##     x, y, relx, rely : 해당 좌표위치로 위젯 이동
##     width, height, relwidth, relheight : 위젯의 크기 변경
##     anchor : 위젯의 기본 조정 위치를 변경 (기본값 = 왼쪽 상단 모서리)
## ====================================================================

## --------------------------------------------------------------------
## 모듈 로딩 
## --------------------------------------------------------------------
import tkinter

## --------------------------------------------------------------------
##- 윈도우 관련 
## --------------------------------------------------------------------
##- 윈도우 창 인스턴스 생성 및 설정
window = tkinter.Tk()
window.title("LAYOUT_PLACE")
window.geometry('600x400')
# window.resizable(False, False)


## --------------------------------------------------------------------
##- 윈도우에 배치될 UI요소들 - Button 요소
## --------------------------------------------------------------------
b1 = tkinter.Button(window, text="(50,50)", bg='yellow')
b2 = tkinter.Button(window, text="(50,100)", bg='yellow')
b3 = tkinter.Button(window, text="(100,150)", bg='yellow')
b4 = tkinter.Button(window, text="(0,200)", bg='yellow')
b5 = tkinter.Button(window, text="(0,300)", bg='yellow')
b6 = tkinter.Button(window, text="(rx, ry)", bg='black', fg="white")

##- place로 배치하게
b1.place(x=50, y=50)
b2.place(x=50, y=100, width=50, height=50)
b3.place(x=100, y=150, bordermode='inside')

b4.place(x=0, y=200, relwidth=0.5) ## relwidth : 부모의 폭의 50%
b5.place(y=300, relx=0.5) ## relx : 부모의 폭의 50% 지점
b6.place(relx=0.5, rely=0.5, anchor='se')


## --------------------------------------------------------------------
##- 윈도우에서 발생하는 사용자 이벤트 수신
## --------------------------------------------------------------------
##- 종료 전까지 동작
window.mainloop()