## ====================================================================
##              Python GUI Programming - TKinter 
## ====================================================================
## Container 위젯 : 여러개의 위젯을 담을 수 있는 위젯
##  - 대표  위젯 : Frame, TopLevel
##  - Frame 위젯 : 포함된 위젯들의 부모가 됨!
##      * 사용 : Frame 인스턴스 생성
##              UI 위젯 인스턴스 생성 시 Frame을 인자로 줌
## ====================================================================

## --------------------------------------------------------------------
## 모듈 로딩 
## --------------------------------------------------------------------
import tkinter

## --------------------------------------------------------------------
##- 윈도우 관련 
## --------------------------------------------------------------------
##- 윈도우 창 인스턴스 생성 및 설정
window = tkinter.Tk()
window.title("Container Widget - Frame ")
window.geometry('900x400')
# window.resizable(False, False)


## --------------------------------------------------------------------
##- 위젯 객체 생성 및 설정
## --------------------------------------------------------------------
##- ID 라벨과 입력란 
idLB = tkinter.Label(window, text="ID")
idENT = tkinter.Entry(window)

#- pack으로 배치
idLB.pack(anchor='w')
idENT.pack(anchor='w',fill='x')

##- PW 라벨과 입력란
pwFR = tkinter.Frame(window, bg='lightyellow', bd=2, relief='solid')
pwLB = tkinter.Label(pwFR, text='PW')
pwENT = tkinter.Entry(pwFR)

##- Frame과 Frame 자식 객체 배치
# pwFR.pack(anchor='w', fill='x')
pwFR.pack(anchor='center',padx=10, pady=10)
pwLB.grid(row=0, column=0)
pwENT.grid(row=0, column=2)

## --------------------------------------------------------------------
##- 윈도우에서 발생하는 사용자 이벤트 수신
## --------------------------------------------------------------------
##- 종료 전까지 동작
window.mainloop()