## ====================================================================
##              Python GUI Programming - TKinter 
## ====================================================================
## 키 이벤트 처리
##  - 이벤트 소스(Widget) -- 이벤트 처리함수(핸들러/리스너) : 연결(Bind)
##  - 이벤트 종류/타입
##      * <Return>  : 엔터키 눌렀을 때
##      * <Pause>   : Pause 키 눌렀을 때
##      * <Delete>  : del키 눌렀을 때
## ====================================================================

## --------------------------------------------------------------------
## 모듈 로딩 
## --------------------------------------------------------------------
import tkinter

## --------------------------------------------------------------------
##- 윈도우 관련 
## --------------------------------------------------------------------
##- 윈도우 창 인스턴스 생성 및 설정
window = tkinter.Tk()
window.title("Window Mosue Evnet")
window.geometry('300x300')
window.resizable(False, False)


## --------------------------------------------------------------------
##- 윈도우에서 발생하는 이벤트 처리 핸들러/함수
## --------------------------------------------------------------------
##- 함수기능 : 엔터키 이벤트 처리 함수
##- 함수이름 : enterKey
##- 매개변수 : event
##- 반환결과 : 없음. entry 위젯에 입력된 데이터 가져와서 출력
def enterKey(event) :
    print(f'{event}')
    # - 현재 입력된 내용 가져오기
    msg = msgEnt.get()
    print(f'입력 msg : {msg}')

    # - 입력된 내용 지우기
    msgEnt.delete(0,'end')
    

## --------------------------------------------------------------------
##- ui 위젯 생성 및 설정
## --------------------------------------------------------------------
## - 메시지 입력 위젯 추가
msgEnt= tkinter.Entry(window)
msgEnt.pack(side='left')
msgEnt.focus()

## --------------------------------------------------------------------
##- 이벤트와 이벤트 핸들러 등록/설정 => bind()
## --------------------------------------------------------------------
##- 윈도우에 핸들러 등록
window.bind('<Return>', enterKey)




## --------------------------------------------------------------------
##- 윈도우에서 발생하는 사용자 이벤트 수신
## --------------------------------------------------------------------
##- 종료 전까지 동작
window.mainloop()