## ===============================================================
## 조회 개수 제한 / 중복제거/ 정렬
## ===============================================================
## DB선택

use sakila;

## ===============================================================
## 조회 결과 개수 제한 : limit 숫자 => 0부터 ~ 숫자 개수
##                     limit 첫번째 부터 몇개 건너뛸 개수, 조회 개수
## ===============================================================
select * from customer;

select * from customer limit 5; 

-- 5개 건너뛰고 3개
select * from customer limit 5; 

-- 5개 건너뒤고 3개 : limit 추출개수 offset 건너뛸 개수
select * from customer limit 3 offset 5; 
