## ================================================================
## 제약 조건 : 컬럼 데이터 추가에 대한 다양한 조건들
##           1) pk & fk : 테이블 간의 관계 설정
##              pk - 부모테이블     fk - 자식 테이블
## ================================================================

## ================================================================
## db선택 및 tb 생성
## ================================================================
use doitsql;

create table parent( col_1 int PRIMARY key);
-- drop table parent;
create table child (col_1 int,
                    Foreign Key (col_1) REFERENCES parent(col_1));


## ================================================================
## 데이터 추가 : 외래키의 경우 부모에 같은 값이 있어야 함
## ================================================================
## parent에 데이터 추가 
insert into parent values(1), (2), (12);

## child에 데이터 추가 
insert into child values(1);
-- insert into child values(11); => ERROR, 부모에 11이 없음


## ================================================================
## 데이터 삭제 : 
## ================================================================
## parent에서 삭제 : delete from 테이블이름 where 조건
-- delete from parent where col_1 = 1; => ERROR, 사용중인 외래키가 있어 삭제 불가
delete from parent where col_1 = 11;

## child 삭제
delete from child where col_1 = 1;
delete from parent where col_1 = 1; -- 먼저 사용중인 자식 삭제 후 삭제

## ================================================================
## 데이터 조회
## ================================================================
select * from parent;
select * from child;
