## =================================================================
##                  변수 선언 및 초기화 / 사용
## =================================================================

## =================================================================
##            변수 선언 및 초기화 :  set   @변수명  := 값;
##                                select @변수명 := 값;
## =================================================================
set @x := 20;
set @y := 20;

select @x + @y;


## sakila db의 store_id 개수를 변수로 저장
set @cnt := (select count(store_id) from sakila.customer);

select @cnt;


## ==========================================================
## 시스템 변수 : mysql에서 미리 만들어둔 내장 변수들
## ==========================================================
## 시스템 변수 중 일부만 보기
## 시스템 변수 수정 (단, 권한이 필요함)

show global variables;

show global variables like 'CHAR%';


